Repository: huixiangyang/arc-kit
Catalog: Sources/Platform/Persistence/Resources/Localization/Persistence.xcstrings
Source language: en
Languages: zh_hans

# asset.asset.record.contains.invalid.path
source: Asset record contains an invalid path
zh_hans: 资源记录包含无效路径

# asset.existing.asset.verification.reuse.refused.failed
source: Existing asset failed verification; reuse refused
zh_hans: 已有资源校验失败，拒绝复用

# asset.invalid.asset.extension
source: Invalid asset extension
zh_hans: 资源扩展名无效

# asset.invalid.asset.size.file.type
source: Invalid asset size or file type
zh_hans: 资源体积或文件类型无效

# database.another.app.using.data.folder
source: Another app is using this data folder. A second configuration writer is not allowed.
zh_hans: 已有应用正在使用该数据目录，拒绝启动第二个配置写入者

# database.app.still.using.data
source: The app is still using the data. Quit it first.
zh_hans: 应用仍在使用数据，请先退出

# database.app.still.using.database
source: The app is still using the database. Quit before restoring.
zh_hans: 应用仍在使用数据库，请退出后恢复

# database.backup.destination.already.exists
source: Backup destination already exists
zh_hans: 备份目标已存在

# database.backup.integrity.check.failed
source: Backup integrity check failed
zh_hans: 备份完整性校验失败

# database.backup.version.integrity.mismatch
source: Backup version or integrity mismatch
zh_hans: 备份版本或完整性不匹配

# database.configuration.database.notReady
source: Configuration database not ready
zh_hans: 配置数据库尚未准备完成

# database.data.created.newer.version
source: Data was created by a newer version. Overwrite refused.
zh_hans: 此数据由较新版本创建，拒绝覆盖

# database.database.metadata.missing
source: Database metadata missing
zh_hans: 数据库元信息缺失

# database.invalid.configuration.revision
source: Invalid configuration revision
zh_hans: 配置代次无效

# database.readOnly
source: Background services cannot modify configuration
zh_hans: 后台不能修改配置

# database.readOnlyRestoreFailed
source: Cannot restore a read-only database
zh_hans: 只读数据库无法恢复

# database.readOnlyRestoreRejected
source: A read-only connection cannot restore the database
zh_hans: 只读连接不能恢复数据库

# database.schemaMismatch
source: Database version mismatch. Complete migration and restart the background service.
zh_hans: 数据库版本不匹配，请完成迁移后重启后台

# record.configuration.field.type.mismatch
source: Configuration field type mismatch: %1$@.%2$@
zh_hans: 配置字段类型不匹配：%1$@.%2$@

# record.duplicateSingleton
source: Singleton configuration contains duplicate records
zh_hans: 单例配置包含重复记录

# record.field.declare.complex.value.type
source: Field %1$@ must declare its complex value type
zh_hans: 字段 %1$@ 必须声明复杂参数类型

# record.invalid.collection.format
source: Invalid collection format: %1$@
zh_hans: 集合格式错误：%1$@

# record.invalid.configuration.field.type.manifest
source: Invalid configuration field type manifest
zh_hans: 配置字段类型清单无效

# record.record.object
source: Record must be an object
zh_hans: 记录必须是对象
